In [44]:
import pandas as pd
from sqlalchemy import create_engine, text

# Creazione connessione al database (PostgreSQL in questo caso)
engine = create_engine('postgresql+psycopg2://postgres:mypassword@localhost:5432/esercizio')

with engine.begin() as conn: # apertura della connessione 
    # Creazione della tabella Schiavi o replace se esiste già
    conn.execute(
        text("""
        DROP TABLE IF EXISTS Schiavi;           -- Elimina la tabella se esiste già
        CREATE TABLE IF NOT EXISTS Schiavi (
            id SERIAL PRIMARY KEY,              -- ID univoco per ogni schiavo
            nome VARCHAR(50),                   -- Nome dello schiavo   
            eta INTEGER,                        -- Età dello schiavo
            sesso VARCHAR(10),                  -- Sesso dello schiavo
            nazionalita VARCHAR(50),            -- Nazionalità dello schiavo
            data_di_nascita DATE,               -- Data di nascita dello schiavo
            lavoro VARCHAR(100),                -- Mansione dello schiavo
            salario NUMERIC(10, 2)              -- Salario dello schiavo
        )
        """)
    )

query = "SELECT * FROM Schiavi"
tabella = pd.read_sql(query, engine)
print(tabella)

Empty DataFrame
Columns: [id, nome, eta, sesso, nazionalita, data_di_nascita, lavoro, salario]
Index: []

In [45]:
# inserisci dati nel database schiavi
with engine.begin() as conn:
    conn.execute(
        text("""
        INSERT INTO Schiavi (nome, eta, sesso, nazionalita, data_di_nascita, lavoro, salario)    
        VALUES
        ('Marco', 30, 'Maschio', 'Italiano', '1993-05-15', 'Agricoltore', 1200.00),
        ('Sara', 25, 'Femmina', 'Spagnola', '1998-08-20', 'Cuoca', 1100.00),
        ('Luca', 40, 'Maschio', 'Francese', '1983-02-10', 'Falegname', 1500.00),
        ('Anna', 35, 'Femmina', 'Tedesca', '1988-12-05', 'Insegnante', 1300.00),
        ('Ahmed', 28, 'Maschio', 'Egiziano', '1995-03-25', 'Ingegnere', 1400.00),
        ('Fatima', 32, 'Femmina', 'Marocchina', '1991-07-30', 'Medico', 1600.00),
        ('John', 45, 'Maschio', 'Americano', '1978-11-12', 'Programmatore', 1800.00),
        ('Maria', 29, 'Femmina', 'Portoghese', '1994-04-18', 'Designer', 1250.00)
        """)
    )

query = "SELECT * FROM Schiavi"
tabella = pd.read_sql(query, engine)
tabella

,id,nome,eta,sesso,nazionalita,data_di_nascita,lavoro,salario
0,1,Marco,30,Maschio,Italiano,1993-05-15,Agricoltore,1200.0
1,2,Sara,25,Femmina,Spagnola,1998-08-20,Cuoca,1100.0
2,3,Luca,40,Maschio,Francese,1983-02-10,Falegname,1500.0
3,4,Anna,35,Femmina,Tedesca,1988-12-05,Insegnante,1300.0
4,5,Ahmed,28,Maschio,Egiziano,1995-03-25,Ingegnere,1400.0
5,6,Fatima,32,Femmina,Marocchina,1991-07-30,Medico,1600.0
6,7,John,45,Maschio,Americano,1978-11-12,Programmatore,1800.0
7,8,Maria,29,Femmina,Portoghese,1994-04-18,Designer,1250.0

In [46]:
# Update dei dati
with engine.begin() as conn:
    conn.execute(
        text("""
        UPDATE Schiavi
        SET salario = salario * 0.8     -- Riduce il salario del 20%
        WHERE salario > 1100.00         -- Applica la riduzione solo a chi guadagna più di 1100;
        """)
    )

query = "SELECT * FROM Schiavi"
tabella = pd.read_sql(query, engine)
tabella = tabella.sort_values(by='id', ascending=True)  # sort by id in ascending order
tabella

,id,nome,eta,sesso,nazionalita,data_di_nascita,lavoro,salario
1,1,Marco,30,Maschio,Italiano,1993-05-15,Agricoltore,960.0
0,2,Sara,25,Femmina,Spagnola,1998-08-20,Cuoca,1100.0
2,3,Luca,40,Maschio,Francese,1983-02-10,Falegname,1200.0
3,4,Anna,35,Femmina,Tedesca,1988-12-05,Insegnante,1040.0
4,5,Ahmed,28,Maschio,Egiziano,1995-03-25,Ingegnere,1120.0
5,6,Fatima,32,Femmina,Marocchina,1991-07-30,Medico,1280.0
6,7,John,45,Maschio,Americano,1978-11-12,Programmatore,1440.0
7,8,Maria,29,Femmina,Portoghese,1994-04-18,Designer,1000.0

In [47]:
# esempio delete dati
with engine.begin() as conn:
    conn.execute(
        text("""
        DELETE FROM Schiavi
        WHERE salario > 1200.00  -- Elimina gli schiavi con salario superiore a 1200
        """)
    )

query = "SELECT * FROM Schiavi"
tabella = pd.read_sql(query, engine)
tabella = tabella.sort_values(by='id', ascending=True)  # sort by id in ascending order
tabella

   id   nome  eta    sesso nazionalita data_di_nascita       lavoro  salario
1   1  Marco   30  Maschio    Italiano      1993-05-15  Agricoltore    960.0
0   2   Sara   25  Femmina    Spagnola      1998-08-20        Cuoca   1100.0
2   3   Luca   40  Maschio    Francese      1983-02-10    Falegname   1200.0
3   4   Anna   35  Femmina     Tedesca      1988-12-05   Insegnante   1040.0
4   5  Ahmed   28  Maschio    Egiziano      1995-03-25    Ingegnere   1120.0
5   8  Maria   29  Femmina  Portoghese      1994-04-18     Designer   1000.0

In [48]:
# esempio order by 
query = "SELECT * FROM Schiavi ORDER BY salario DESC"
tabella = pd.read_sql(query, engine)
tabella

   id   nome  eta    sesso nazionalita data_di_nascita       lavoro  salario
0   3   Luca   40  Maschio    Francese      1983-02-10    Falegname   1200.0
1   5  Ahmed   28  Maschio    Egiziano      1995-03-25    Ingegnere   1120.0
2   2   Sara   25  Femmina    Spagnola      1998-08-20        Cuoca   1100.0
3   4   Anna   35  Femmina     Tedesca      1988-12-05   Insegnante   1040.0
4   8  Maria   29  Femmina  Portoghese      1994-04-18     Designer   1000.0
5   1  Marco   30  Maschio    Italiano      1993-05-15  Agricoltore    960.0

In [49]:
# inserisci altri dati
with engine.begin() as conn:
    conn.execute(
        text("""
        INSERT INTO Schiavi (nome, eta, sesso, nazionalita, data_di_nascita, lavoro, salario)
        VALUES
        ('Giovanni', 38, 'Maschio', 'Italiano', '1985-01-01', 'Architetto', 1700.00),
        ('Elena', 31, 'Femmina', 'Spagnola', '1992-06-15', 'Avvocato', 1550.00)
        """)
    )

query = "SELECT * FROM Schiavi"
tabella = pd.read_sql(query, engine)
tabella = tabella.sort_values(by='id', ascending=True)  # sort by id in ascending order
tabella

,id,nome,eta,sesso,nazionalita,data_di_nascita,lavoro,salario
1,1,Marco,30,Maschio,Italiano,1993-05-15,Agricoltore,960.0
0,2,Sara,25,Femmina,Spagnola,1998-08-20,Cuoca,1100.0
2,3,Luca,40,Maschio,Francese,1983-02-10,Falegname,1200.0
3,4,Anna,35,Femmina,Tedesca,1988-12-05,Insegnante,1040.0
4,5,Ahmed,28,Maschio,Egiziano,1995-03-25,Ingegnere,1120.0
5,8,Maria,29,Femmina,Portoghese,1994-04-18,Designer,1000.0
6,9,Giovanni,38,Maschio,Italiano,1985-01-01,Architetto,1700.0
7,10,Elena,31,Femmina,Spagnola,1992-06-15,Avvocato,1550.0

In [50]:
# nome schiavi italiani
query = "SELECT id, nome FROM Schiavi WHERE nazionalita = 'Italiano'"
tabella = pd.read_sql(query, engine)
tabella

   id      nome
0   1     Marco
1   9  Giovanni

In [51]:
# raggruppa per nazionalità e calcola il salario totale
query = "SELECT nazionalita, SUM(salario) AS salario_totale FROM Schiavi GROUP BY nazionalita ORDER BY salario_totale DESC"
tabella = pd.read_sql(query, engine)
# scrivi la tabella ottenuta in file csv e json
tabella.to_csv('salario_totale_per_nazionalita.csv', index=False)
tabella.to_json('salario_totale_per_nazionalita.json', orient='records', lines=True)
tabella

  nazionalita  salario_totale
0    Italiano          2660.0
1    Spagnola          2650.0
2    Francese          1200.0
3    Egiziano          1120.0
4     Tedesca          1040.0
5  Portoghese          1000.0

In [52]:
# esporta in un file SQLite 
import sqlite3
connsqlite = sqlite3.connect('esercizio.db')
tabella = pd.read_sql("SELECT * FROM Schiavi", engine)
tabella.to_sql('Schiavi', connsqlite, if_exists='replace', index=False)
connsqlite.close()